{
    "GolfuX":{
        "href":"https://github.com/Kyoraku2/GolfuX.github.io",
        "title_fr":"GolfuX",
        "title_en":"GolfuX",
        "subtitle_fr":"Un jeu mobile de Mini-Golf multijoueur",
        "subtitle_en":"A multiplayer Mini-Golf mobile game",
        "image":"golfux.png",
        "description_fr":"C'est un projet durant lequel, en collaboration avec 2 camarades, nous avons développé une PWA (Progressive Web Application) pour mon projet de fin de licence. Il s'agit d'un jeu de MiniGolf en tour par tour et en temps réel permettant aux utilisateurs de jouer seuls ou avec leurs amis, en réseau local ou en ligne. Ce projet a commencé en septembre 2021 et sera terminé en mars 2022.",
        "description_en":"This is a project during which, in collaboration with 2 co-workers, we developed a PWA (Progressive Web Application) for my graduation project. It is a real-time, turn-based Mini-Golfen game allowing users to play alone or with their friends, in a local network or online. This project started in September 2021 and will be completed in March 2022.",
        "skills":["PWA","HTML5","CSS","JavaScript","Box2D","NodeJS","Team work","Git"]
    },
    "React":{
        "href":"https://github.com/Kyoraku2/ToDo-React",
        "title_fr":"To-Do list",
        "title_en":"To-Do list",
        "subtitle_fr":"Une application de gestion de tâches",
        "subtitle_en":"A task management application",
        "image":"todo.PNG",
        "description_fr":"Cette application permet de gérer une liste de tâches à réaliser. Ceci en permettant à l'utilisateur d'ajouter de nouvelles tâches et d'en supprimer. A terme, il sera possible de créer des catégories de tâches.",
        "description_en":"This application allows you to manage a list of tasks to be carried out. This by allowing the user to add new tasks and delete tasks. Eventually, it will be possible to create categories of tasks.",
        "skills":["React","JavaScript","HTML5","CSS"]
    },
    "Yokai":{
        "href":"https://github.com/Kyoraku2/Yokai",
        "title_fr":"Yokai",
        "title_en":"Yokai",
        "subtitle_fr":"Adaptadion du jeu de plateau Yokai",
        "subtitle_en":"Adaptation of the Yokai board game",
        "image":"yokai.png",
        "description_fr":"Cette application web correspond à une adaptation du jeu de plateau Yokai. Jouable par partie de 2 à 4 joueurs votre objectif sera de calmer les Yokais. Ce jeu a été développé en binôme.",
        "description_en":"This web application is an adaptation of the Yokai board game. Playable in games of 2 to 4 players, your objective will be to calm the Yokais. This game was developed in pairs.",
        "skills":["HTML5","CSS","JavaScript","NodeJS","Team work"]
    },
    "Bookshop":{
        "href":"https://github.com/Kyoraku2/Projet-Web",
        "title_fr":"Bookshop",
        "title_en":"Bookshop",
        "subtitle_fr":"Un site fictif de vente de livre en ligne",
        "subtitle_en":"A fictitious online book selling website",
        "image":"bookshop.PNG",
        "description_fr":"Il s'agit du site web d'une librairie fictive simulant la vente de livres en ligne.",
        "description_en":"This is the website of a fictitious bookstore simulating the sale of books online.",
        "skills":["HTML5","CSS","PHP","MySQL","WAMP"]
    },
    "Bataille_navale":{
        "href":"https://github.com/Kyoraku2/bataille_navale",
        "title_fr":"Bataille navale",
        "title_en":"Battleship",
        "subtitle_fr":"Un jeu de bataille naval",
        "subtitle_en":"A Battleship game",
        "image":"bataille.PNG",
        "description_fr":"C'est un jeu de bataille navale en réseau local. Ce jeu permet dans un premier de temps de placer ses bateaux, puis permet à deux joueurs de s'affronter 1vs1.",
        "description_en":"Its a local network game. Initially you will have to place your boats, then two players will fight 1vs1.",
        "skills":["JavaScript","NodeJS","HTML5"]
    },
    "Ludo":{
        "href":"https://github.com/Kyoraku2/Projet-POA",
        "title_fr":"Ludo",
        "title_en":"Ludo",
        "subtitle_fr":"Adaptadion du jeu de plateau Ludo (petits chevaux)",
        "subtitle_en":"Adaptation of the Ludo board game (little horses)",
        "image":"ludo.PNG",
        "description_fr":"Il s'agit d'une adaptation en jeu vidéo du jeu de plateau Ludo. Pour cette application, la librairie JavaSwing et le modèle de conception MVC ont été utilisés.",
        "description_en":"Its a video game adaptation of the board game Ludo. For this application, the JavaSwing library and the MVC design pattern were used.",
        "skills":["Java","MVC","JavaSwing","Git","Team work"]
    },
    "RnDay":{
        "href":"https://github.com/Kyoraku2/Kyoraku2.github.io",
        "title_fr":"R&Day",
        "title_en":"Event website",
        "subtitle_fr":"Site web évènementiel",
        "subtitle_en":"Event website",
        "image":"rnday.PNG",
        "description_fr":"Site réalisé pour la R&Day 2021, un évènement organisé par les étudiants en CMI Informatique dont la thématique était l'informatique quantique. L'évènement était centré sur la question \"L'informatique quantique, le future de l'informatique?\".",
        "description_en":"Website created for the R&Day 2021, an event organized by CMI in computer science students whose theme was quantum computing. The event was centered on the question \"Quantum computing, the future of computing?\".",
        "skills":["HTML5","CSS","JavaScript","Bootstrap","Git"]
    }
}